Revit 2027 API
FailureMessage.GetFailureDefinitionId Method
 Retrieves the id of the failure definition for the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FailureDefinitionId GetFailureDefinitionId()
Public Function GetFailureDefinitionId As FailureDefinitionId
public:
FailureDefinitionId^ GetFailureDefinitionId()
member GetFailureDefinitionId : unit -> FailureDefinitionId
Return Value
FailureDefinitionId
 The id of the FailureDefinition for the failure.
See Also
Reference
FailureMessage Class
Autodesk.Revit.DB Namespace